zeromem0/cores3_adv/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_EXAMPLE_KBD_ENABLE=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_SM_LVL=2
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_SVC_GAP_DEVICE_NAME="CardputerADV Keyboard"
CONFIG_BT_NIMBLE_SVC_BAS_BATTERY_LEVEL_NOTIFY=y
# Request connection parameters optimised for a HID keyboard.
# See ble_gap_upd_params in source code for dynamic set.
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_MIN_CONN_INTERVAL=12
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_MAX_CONN_INTERVAL=48
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_SLAVE_LATENCY=8
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_SUPERVISION_TMO=600
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESPNOW_CONTROL_AUTO_CHANNEL_SENDING=y
CONFIG_ESPNOW_CONTROL_AUTO_CHANNEL_FORWARD=y
CONFIG_TINYUSB_HID_COUNT=1

# --- Memory budget ---
#
# This board has no PSRAM, and 512 KB of SRAM has to cover the firmware
# image, the WiFi stack and everything an application allocates. With the
# stock settings, WiFi left 92 KB free but no contiguous block larger
# than 31 KB, which is below what the phrase recogniser and the emulator
# ask for in one piece. Together the options below give 143 KB free and
# a 65 KB largest block with the network up.

# Code size is memory here, not just flash: on the S3 the IRAM the image
# does not use is handed to the heap, so a smaller image moves the
# IRAM/DRAM boundary down. This alone grows the main heap region from
# 200 to 227 KiB. Costs comfortable single-stepping in a debugger.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Without PSRAM the data cache only serves rodata reads from flash, so
# half of it buys more than it costs. The freed 16 KB shows up as its
# own heap region at 0x3C000000, contiguous and untouched by the WiFi
# allocations that fragment the main one.
CONFIG_ESP32S3_DATA_CACHE_16KB=y

# WiFi code kept out of IRAM, for the same boundary. The cost is
# throughput, which does not matter to a panel mirror sending a few tens
# of KB a second.
# CONFIG_ESP_WIFI_IRAM_OPT is not set
# CONFIG_ESP_WIFI_RX_IRAM_OPT is not set

# Buffer pools sized for a device that talks to one access point and
# serves one page, rather than for maximum throughput.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=12
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=12
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=8
CONFIG_ESP_WIFI_RX_BA_WIN=2
CONFIG_ESP_WIFI_TX_BA_WIN=2

# Ten, and not fewer: esp_http_server opens seven sockets and keeps three
# of its own, so at six it refuses to start with ESP_ERR_INVALID_ARG and
# the remote page never comes up.
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=2880
CONFIG_LWIP_TCP_WND_DEFAULT=2880

# --- Task statistics ---
#
# What the TaskMan application reads. The trace facility is what makes
# uxTaskGetSystemState() exist at all; the run time stats are the only
# way to know how the processor is being spent, since without them even
# the idle task's share is unknowable. Both cost a little: a few bytes
# per task, and a counter read on every context switch.
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y

# --- PSRAM, which this board has and the StampS3 did not ---
#
# The notes above were written for a board with none, where every
# kilobyte of internal RAM was fought over. The CoreS3 carries 8 MB of
# quad PSRAM, and the difference matters on a 320x240 panel: the
# application canvas alone is 138 KB, so an application that released it
# could fail to get it back and the screen stayed black with only the
# status bar on it.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Large allocations land in PSRAM, small ones stay internal where they
# are faster, and a reserve keeps DMA-capable memory available.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
